[
  {
    "backgroundImage": "Index-Uploads/Images/HomepageShot.png",
    "cardName": "Building My Portfolio",
    "description": "I created a responsive portfolio website to showcase my programming projects using HTML, CSS, and JavaScript. The website includes an interactive section where visitors can click on each project card to reveal more details about the project, such as its description, live demo link, and source code link. To populate the project cards, I used JSON data and dynamically generated the card elements with JavaScript. The website also features a navigation menu that smoothly scrolls to each section, as well as a responsive design that adapts to different screen sizes. Through this project, I practiced my front-end web development skills and learned how to effectively use JavaScript to manipulate the DOM and create dynamic web content.",
    "liveDemoLink": "http://web-jose.github.io/",
    "sourceCodeLink": "https://github.com/Web-Jose/Web-Jose.github.io"
  },
  {
    "backgroundImage": "Index-Uploads/Images/SortingBenchmark.jpg",
    "cardName": "Sorting Algorithms Benchmark",
    "description": "This code defines a class called MyArray which generates an array of 10000 random integers between 0-999, and then sorts the array using five different algorithms: Selection Sort, Insertion Sort, Bubble Sort, Merge Sort, and Quick Sort. The sorting algorithms are timed and the durations are stored in a vector called TimeCodes. The MyArray class has methods that make a copy of the original array, and then sort these copies using each of the algorithms. The sorted arrays are printed out to the console for visualization. The duration of each algorithm execution is printed out to the console as well. The program uses C++ standard libraries: iostream, vector, and chrono.",
    "liveDemoLink": "https://onlinegdb.com/t9OTlGKb7",
    "sourceCodeLink": "https://github.com/Web-Jose/Sorting-Algorithms-Benchmark"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Dining-Hall.jpg",
    "cardName": "Dynamic Dining Hall Menu Integration",
    "description": "As the Sole Developer for Fresno State Student Housing, I innovatively integrated a dynamic weekly menu onto the student housing website using PHP, HTML, CSS, WordPress, Pods Framework plugin, and Shortcode plugin. This project, completed in just a week and a half, significantly enhanced user experience by providing real-time daily menu updates directly on the site, reducing external redirects and thereby decreasing the site's bounce rate. My role involved learning and applying new technologies like Pods, Shortcode, and PHP, and overcoming challenges in layout design and mobile compatibility. Key features included real-time updates, backend interface for administrators, and dynamic display of menu items.",
    "liveDemoLink": "https://fresnostatehousing.org/dining-hall-menu/",
    "sourceCodeLink": "https://github.com/Web-Jose/Dynamic-Dining-Hall-Menu-Integration"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Menu-Dining-Hall.png",
    "cardName": "Automatic Dining Hall Menu Updater",
    "description": "This 4-week project automated the weekly menu updates on the Fresno State Housing website using Node.JS, Axios, PDF-Parse, ChatGPT API, PHP, JSON, and WordPress plugins. As the Sole Developer, I created a system that parses PDF menus and updates the site's database using a ChatGPT API-generated script, scheduled to run weekly via cron jobs. This complex integration greatly improved efficiency and adaptability in content management, while enhancing my skills in various technologies and API integration.",
    "liveDemoLink": "https://github.com/Web-Jose/Menu-Updater",
    "sourceCodeLink": "https://github.com/Web-Jose/Menu-Updater"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Bulldog-Living.JPG",
    "cardName": "Bulldog Living",
    "description": "Bulldog Living is a dynamic web page for Fresno State Student Housing, showcasing student life through articles and event photos. As the Sole Developer and Designer, I used Figma, WordPress, Elementor, HTML, CSS, JavaScript, and PHP to create this page over 3 weeks. The project includes features like a carousel for recent articles and event sections, with PHP template loops ensuring dynamic content display. This project honed my skills in responsive design, PHP, and integrating various web technologies.",
    "liveDemoLink": "https://fresnostatehousing.org/bulldog-living/",
    "sourceCodeLink": "https://github.com/Web-Jose/Bulldog-Living"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Menu-Signage.png",
    "cardName": "Menu Signage",
    "description": "This 2-week project involved creating digital menu signage for Fresno State Student Housing using Figma, Adobe Illustrator and Photoshop, HTML, CSS, JavaScript, and JSON. Designed to resemble a restaurant menu, the digital signage dynamically displays the current day's menu items, updated weekly by the Automatic Dining Hall Menu Updater. This project enhanced the dining experience for residents by providing real-time information in an engaging, visually appealing format. My role as the Sole Developer included overcoming challenges related to screen size compatibility and readability, demonstrating my versatility in design and web development.",
    "liveDemoLink": "https://web-jose.github.io/Dynamic-Menu-Signage/",
    "sourceCodeLink": "https://github.com/Web-Jose/Dynamic-Menu-Signage"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Move-Info-Countdown.jpeg",
    "cardName": "Countdown Widget",
    "description": "Developed for Fresno State Student Housing's Move-In Day page, this project is a customizable countdown timer widget built using HTML, JS, CSS, and Elementor Widget Builder for WordPress. Completed in 2 days, I was the Sole Developer, overcoming the challenge of creating a year-agnostic timer using JavaScript. The widget features a responsive design, dynamic event date calculation, and customizable appearance, making it an adaptable tool for annual events. This project improved my skills in JavaScript and responsive design.",
    "liveDemoLink": "https://fresnostatehousing.org/move-in-info/",
    "sourceCodeLink": "https://github.com/Web-Jose/Countdown-Widget"
  },
  {
    "backgroundImage": "Index-Uploads/Images/MovieCases.jpg",
    "cardName": "Movie & Category Organizer",
    "description": "The Movie and Category Organizer is a C++ program developed for a CSCI 41 project, designed to help users create, manage, and organize movies into different categories. The program uses classes such as Date, Movie, MovieCLL, and Category to hold and organize necessary information, with a circular linked list implemented to hold the movies of each category. Users can insert, delete, and search for movies in specific categories, and the program also includes a vector for easy testing. The Movie and Category Organizer is a practical tool that offers an opportunity to practice object-oriented programming and problem-solving abilities, while keeping movie collections organized and easily accessible.",
    "liveDemoLink": "https://onlinegdb.com/rASlXnQBo",
    "sourceCodeLink": "https://github.com/Web-Jose/Movie-Category-Organizer"
  }
]
