[
  {
    "backgroundImage": "Index-Uploads/Images/HomepageShot.png",
    "cardName": "Building My Portfolio",
    "description": "I created a responsive portfolio website to showcase my programming projects using HTML, CSS, and JavaScript. The website includes an interactive section where visitors can click on each project card to reveal more details about the project, such as its description, live demo link, and source code link. To populate the project cards, I used JSON data and dynamically generated the card elements with JavaScript. The website also features a navigation menu that smoothly scrolls to each section, as well as a responsive design that adapts to different screen sizes. Through this project, I practiced my front-end web development skills and learned how to effectively use JavaScript to manipulate the DOM and create dynamic web content.",
    "liveDemoLink": "http://web-jose.github.io/",
    "sourceCodeLink": "https://github.com/Web-Jose/Web-Jose.github.io"
  },
  {
    "backgroundImage": "Index-Uploads/Images/SortingBenchmark.jpg",
    "cardName": "Sorting Algorithms Benchmark",
    "description": "This code defines a class called MyArray which generates an array of 10000 random integers between 0-999, and then sorts the array using five different algorithms: Selection Sort, Insertion Sort, Bubble Sort, Merge Sort, and Quick Sort. The sorting algorithms are timed and the durations are stored in a vector called TimeCodes. The MyArray class has methods that make a copy of the original array, and then sort these copies using each of the algorithms. The sorted arrays are printed out to the console for visualization. The duration of each algorithm execution is printed out to the console as well. The program uses C++ standard libraries: iostream, vector, and chrono.",
    "liveDemoLink": "https://onlinegdb.com/t9OTlGKb7",
    "sourceCodeLink": "https://github.com/Web-Jose/Sorting-Algorithms-Benchmark"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Dining-Hall.jpg",
    "cardName": "Dynamic Dining Hall Menu Integration",
    "description": "Integrated the weekly menu onto the Fresno State Student Housing website using PHP, HTML, CSS, WordPress, Pods Framework plugin, and Shortcode plugin. Increased user engagement by providing real-time updates and a mobile-friendly layout. Overcame challenges in PHP, Pods, and Shortcode with no prior experience.",
    "liveDemoLink": "https://fresnostatehousing.org/dining-hall-menu/",
    "sourceCodeLink": "https://github.com/Web-Jose/Dynamic-Dining-Hall-Menu-Integration"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Menu-Dining-Hall.png",
    "cardName": "Automatic Dining Hall Menu Updater",
    "description": "Automated weekly menu updates for the Fresno State Housing website using Node.js, Axios, PDF-Parse, ChatGPT API, PHP, JSON, and WordPress tools. Developed a script for parsing PDF menus, updating content using PHP, and scheduling with cron jobs.",
    "liveDemoLink": "https://github.com/Web-Jose/Menu-Updater",
    "sourceCodeLink": "https://github.com/Web-Jose/Menu-Updater"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Bulldog-Living.JPG",
    "cardName": "Bulldog Living",
    "description": "Developed a section for posting articles on Fresno State Student Housing's website using Figma, WordPress, Elementor, HTML, CSS, JavaScript, and PHP. Features include dynamic article display, responsive carousel, and event sections. Overcame challenges in PHP template loops.",
    "liveDemoLink": "https://fresnostatehousing.org/bulldog-living/",
    "sourceCodeLink": "https://github.com/Web-Jose/Bulldog-Living"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Menu-Signage.png",
    "cardName": "Menu Signage",
    "description": " Designed and developed digital menu signage for Fresno State Student Housing using Figma, Adobe Illustrator, Adobe Photoshop, HTML, CSS, JavaScript, and JSON. The signage is TV responsive, dynamically updates menu items, and has an attractive chalkboard design.",
    "liveDemoLink": "https://web-jose.github.io/Dynamic-Menu-Signage/",
    "sourceCodeLink": "https://github.com/Web-Jose/Dynamic-Menu-Signage"
  },
  {
    "backgroundImage": "Index-Uploads/Images/Move-Info-Countdown.jpeg",
    "cardName": "Countdown Widget",
    "description": "Created a countdown timer widget for Fresno State Student Housing's Move-In Day page using HTML, JS, CSS, and Elementor Widget Builder. The widget is customizable with parameters for headline, emojis, event date, and style options. Added logic for annual events handling in JavaScript.",
    "liveDemoLink": "https://fresnostatehousing.org/move-in-info/",
    "sourceCodeLink": "https://github.com/Web-Jose/Countdown-Widget"
  },
  {
    "backgroundImage": "Index-Uploads/Images/MovieCases.jpg",
    "cardName": "Movie & Category Organizer",
    "description": "The Movie and Category Organizer is a C++ program developed for a CSCI 41 project, designed to help users create, manage, and organize movies into different categories. The program uses classes such as Date, Movie, MovieCLL, and Category to hold and organize necessary information, with a circular linked list implemented to hold the movies of each category. Users can insert, delete, and search for movies in specific categories, and the program also includes a vector for easy testing. The Movie and Category Organizer is a practical tool that offers an opportunity to practice object-oriented programming and problem-solving abilities, while keeping movie collections organized and easily accessible.",
    "liveDemoLink": "https://onlinegdb.com/rASlXnQBo",
    "sourceCodeLink": "https://github.com/Web-Jose/Movie-Category-Organizer"
  }
]
